TEST_LIFT_POLIMI_SMART/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;     // ambient reference

boundaryField
{
  left          { type symmetryPlane; }
  right         { type symmetryPlane; }
  front         { type symmetryPlane; }
  back          { type symmetryPlane; }
  substrate     { type calculated; value uniform 1e5; }
  donor         { type calculated; value uniform 1e5; }
}

// ************************************************************************* //
