TEST_LIFT_POLIMI_SMART/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (metal air);

sigma           sigma [ 1 0 -2 0 0 0 0 ] 1.64;

metal
{
    thermoType
    {
        type            heRhoThermo;
        mixture         pureMixture;
        transport       const;
        thermo          hConst;
        equationOfState Boussinesq;
        specie          specie;
        energy          sensibleEnthalpy;
    }

    mixture
    {
        specie
        {
            molWeight       47.867;
        }

        thermodynamics
        {
            Cp              650;    // J/kg/K (molten Ti heat capacity around the melt point)
            Hf              0.0;
            Tref            300;
            Href            0;
        }

        transport
        {
            mu              2.35e-3; // Pa·s (Keene, Int. Mater. Rev. 1993)
            Pr              0.032;   // Consistent with molten metal data
        }

        equationOfState
        {
            rho0            4515;
            beta            7.6e-5;
            T0              300;
        }
    }
}

air
{
    thermoType
    {
        type            hePsiThermo;
        mixture         pureMixture;
        transport       const;
        thermo          hConst;
        equationOfState perfectGas;
        specie          specie;
        energy          sensibleEnthalpy;
    }

    mixture
    {
        specie
        {
            molWeight   28.97;
        }

        thermodynamics
        {
            Cp          1000;
            Hf          0.0;
            Tref        300;
            Href        0;
        }

        transport
        {
            mu          1.8e-5;
            Pr          0.7;
        }

        equationOfState
        {
            R           287;
        }
    }
}
// ************************************************************************* //
