TEST_LIFT_POLIMI_SMART/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// SMART CONTROL FOR CLUSTER: HEATING → MELTING → VAPORIZATION → SOLIDIFICATION
// Reality check: reach 20-50 ps in reasonable walltime (days, not weeks)

application     compInterFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;

// TARGET: Reach 50 ps to see film bulge + jet formation
// This is realistic for multi-day cluster run
endTime         5e-11;         // 50 picoseconds

// ADAPTIVE TIMESTEP STRATEGY
// Start tiny for fs-laser, ramp up as physics allows
deltaT          1e-16;         // 0.1 fs initial
maxDeltaT       1e-12;         // Cap at 1 ps (aggressive but needed for speed)
minDeltaT       1e-17;         // Floor at 0.01 fs

adjustTimeStep  yes;

// COURANT CONSTRAINTS
// Balanced for graded mesh: tighter near film, looser in bulk
maxCo                   0.5;   // Flow Courant
maxAlphaCo              0.3;   // Interface Courant
maxThermalCourant       0.3;   // Thermal (critical for 2nm cells!)
maxDi                   10;    // Interface dilation

// OUTPUT CONTROL
// Balance: enough data to see physics, not so much we run out of disk
writeControl    adjustableRunTime;
writeInterval   1e-12;         // Every 1 ps
purgeWrite      50;            // Keep last 50 times → ~50 ps history

writeFormat     binary;        // Fast I/O for cluster
writePrecision  8;
writeCompression off;          // No compression for speed
timeFormat      scientific;
timePrecision   10;
fileHandler     uncollated;    // Good for parallel I/O

runTimeModifiable yes;
verbose         true;
enableLiftProcessTracker true;

// LASER TIMING
// 200 fs pulse, but keep heating active slightly longer for e-ph coupling
laserStartTime      0;
laserEndTime        5e-13;     // 500 fs

// PHASE CHANGE - COMPLETE CYCLE
phaseChangeCoeffs
{
    model               clausius_clapeyron;
    hf                  [0 2 -2 0 0 0 0] 9.1e6;      // J/kg vaporization
    gasConstant         [0 2 -2 -1 0 0 0] 174;       // J/kg/K Ti vapor
    Tsol                [0 0 0 1 0 0 0] 1941;        // K melting
    Tvap                [0 0 0 1 0 0 0] 2200;        // K superheated evap

    evaporationCoeff       0.3;
    alphaMin              0.001;
    dtFloor             1e-16;
    relaxationTime      1e-12;
    maxSource           [1 -1 -3 0 0 0 0] 1e22;
    minCoefficient      1e6;
    onlyAboveVapor      false;         // Recoil in superheated regime

    // Active through full simulation
    activationTime      ((0 5e-11));
}

// MASS TRANSFER
massTransferCoeffs
{
    tStart  (0);
    tEnd    (5e-11);
    rateMax 3e13;
}

// ADVANCED INTERFACE CAPTURING
useAdvancedInterfaceCapturing  true;

advancedInterfaceCapturing
{
    model               kinetic_theory;
    stickingCoeff       0.18;
    momentumAccommodationCoeff       0.18;
    recoilTempOffset      0;
    phaseChangeTempOffset 0;
    massRateEps           1e-6;
    recoilMax             3.0e9;       // GPa recoil
    clampRecoil           false;
    scaleRecoilMax        false;
    recoilRelax           0.5;
    alphaMin              0.001;
    maxPhysicalTemperature 10000;
    maxRecoilPressure   3.0e9;
}

logRecoilSuppression true;

// TEMPERATURE LIMITS
enableTClamp    false;
minT            200;
maxT            10000;

// TWO-TEMPERATURE MODEL - TUNED FOR GRADED MESH
twoTemperatureProperties
{
    // Electronic heat capacity: Ce = γTe
    Ce
    {
        type        polynomial;
        value       0;
        coeffs
        (
            (0   0)      // Constant = 0
            (630 1)      // Linear: 630·Te
        );
    }

    // Electron-phonon coupling (temperature-dependent)
    G
    {
        type table;
        values
        (
            (300      1.0e18)
            (1000     2.0e18)
            (2000     1.5e18)
            (3000     4.0e18)
            (5000     1.5e19)
            (10000    8.0e19)
            (20000    2.5e20)
        );
    }

    Cl  [1 -1 -2 -1 0 0 0] 2.5e6;      // Lattice heat capacity
    De  [0  2 -1  0 0 0 0] 1e-4;       // Electron diffusivity

    // Gas-metal exchange
    gasMetalExchangeCoeff
    {
        type        kapitza;
        Z_metal     2.3e7;
        Z_gas       383;
        rho_metal   4500;
        rho_gas     1.7;
        maxTemperature 0;
    }

    gasMetalCutoffTemperature 2200;
    minMetalFractionForExchange 0.5;
    minGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 1e8;
    maxGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 5e9;
    maxGasMetalHeatFlux    5e9;

    minTe           200;
    maxTe           20000;
    maxTl           10000;
    ambientTemperature 300;
    temperatureDifferenceFloor 10.0;

    // ADAPTIVE ELECTRON SUBSTEPPING
    // With 2nm cells in film, we need more substeps
    electronSubCycles        1;
    minElectronSubCycles     1;
    maxElectronSubCycles     20;       // More for fine cells
    maxElectronDeltaT        [0 0 1 0 0 0 0] 5e-16;

    nInnerCouplingSweeps         2;
    innerCouplingResidualTol     1e-3;

    klHighTThreshold 1000;
    klExponent       0.5;

    metalFractionFloor      1e-9;
    metalFractionCutoff     1e-6;
    metalAmbientBlendWidth  1e-3;
    CvolGasFloor            1e6;

    energyTolerance         0.02;
    energyDiagnostics       true;
    temperatureDiagnostics  true;
    energyAudit             true;
}

// MONITORING & DIAGNOSTICS
functions
{
    // Probe key locations
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   100;         // Every 100 steps

        fields
        (
            T
            Tl
            Te
            p_rgh
            alpha.metal
            U
        );

        probeLocations
        (
            (15e-6  20.0357e-6  1.5e-6)    // Film center (laser focus)
            (15e-6  20.0000e-6  1.5e-6)    // Film bottom (Ti-air interface)
            (15e-6  20.0714e-6  1.5e-6)    // Film top (Ti-donor interface)
            (15e-6  8.0000e-6   1.5e-6)    // Substrate-air interface
            (15e-6  19.5000e-6  1.5e-6)    // Near film (0.5 μm below)
        );
    }

    // Mid-plane slice for visualization
    midPlane
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        surfaceFormat   vtk;
        fields          (alpha.metal Tl Te T p_rgh U);

        surfaces
        (
            xNormal
            {
                type                cuttingPlane;
                planeType           pointAndNormal;
                pointAndNormalDict
                {
                    point   (15e-6 10e-6 1.5e-6);
                    normal  (1 0 0);
                }
                interpolate         true;
            }
        );
    }
}

// ============================================================================
// RUNTIME ESTIMATES FOR CLUSTER
// ============================================================================
//
// Mesh: ~5M cells, 128 cores
//
// Phase 1 (0-0.2 ps): Laser heating
// - Δt ~ 0.1-0.5 fs
// - ~400-2000 steps
// - Time: ~0.5-2 hours
//
// Phase 2 (0.2-5 ps): Heating + melting
// - Δt ~ 1-10 fs (adaptive growth)
// - ~500-5000 steps
// - Time: ~2-20 hours
//
// Phase 3 (5-50 ps): Evaporation + jet
// - Δt ~ 10-100 fs (maxDeltaT allows 1 ps!)
// - ~500-5000 steps
// - Time: ~2-20 hours
//
// Total to 50 ps: ~5-40 hours (1-2 days)
// This is REALISTIC for a cluster run!
//
// If you need longer:
// - Extend endTime to 1e-10 (100 ps)
// - Increase maxDeltaT to 2e-12 (2 ps) after initial heating
// - Use runtime modification to adjust on the fly

// ************************************************************************* //
